# Тема “Вычисления с помощью Numpy”

## Задание 1

In [3]:
import numpy as np

In [9]:
a = np.array([[1, 6]
             ,[2, 8]
             ,[3, 11]
             ,[3, 10]
             ,[1, 7]])

In [10]:
print(a)
print("Размер массива: ", a.shape)

[[ 1  6]
 [ 2  8]
 [ 3 11]
 [ 3 10]
 [ 1  7]]
Размер массива:  (5, 2)

In [11]:
mean_a = a.mean(axis = 0)
print("Средние квадратические отклонения столбцов: ", mean_a)

Средние квадратические отклонения столбцов:  [2.  8.4]

## Задание 2

In [12]:
a_centered = a - mean_a
print(a_centered)
print("Размер массива: ", a_centered.shape)

[[-1.  -2.4]
 [ 0.  -0.4]
 [ 1.   2.6]
 [ 1.   1.6]
 [-1.  -1.4]]
Размер массива:  (5, 2)

## Задание 3

In [31]:
a_centered_sp = a_centered[:, 0] @ a_centered[:, 1]
print(a_centered_sp)

8.0

In [32]:
a_centered_sp = a_centered_sp / (5-1)
print(a_centered_sp)

2.0

## Задание 4

In [34]:
 b = np.cov(np.transpose(a))
print(b[1 , 0])

2.0

# Тема “Работа с данными в Pandas”

## Задание 1

In [1]:
import pandas as pd

In [14]:
authors = pd.DataFrame({
    "author_id"   : [1, 2, 3],
    "author_name" : ["Тургенев", "Чехов", "Островский"]
})
authors

   author_id author_name
0          1    Тургенев
1          2       Чехов
2          3  Островский

In [15]:
book = pd.DataFrame({
    "author_id" : [1, 1, 1, 2, 2, 3, 3] ,
    "book_title" : ['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],
    "price" : [450, 300, 350, 500, 450, 370, 290]
})
book

   author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

## Задание 2

In [18]:
authors_price = pd.merge(authors, book, on='author_id', how='left')
authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

## Задание 3

In [20]:
top5 = authors_price.nlargest(5, "price")
top5

   author_id author_name         book_title  price
3          2       Чехов   Толстый и тонкий    500
0          1    Тургенев        Отцы и дети    450
4          2       Чехов    Дама с собачкой    450
5          3  Островский              Гроза    370
2          1    Тургенев  Дворянское гнездо    350

## Задание 4

In [35]:
groupby = authors_price.groupby("author_name")
authors_stat = pd.DataFrame({
    "max_price " : groupby["price"].max(),
    "min_price" : groupby["price"].min(),
    "mean_price" : groupby["price"].mean()
    
    })
authors_stat

             max_price   min_price  mean_price
author_name
Островский          370        290  330.000000
Тургенев            450        300  366.666667
Чехов               500        450  475.000000